---
kind: type
id: T:Autodesk.Revit.DB.ExternalGeometryId
source: html/6074854d-72b6-fa2f-b4ec-df48a33b862b.htm
---
# Autodesk.Revit.DB.ExternalGeometryId

This class represents an identifier for geometry from external sources.

## Syntax (C#)
```csharp
public class ExternalGeometryId : IDisposable
```